yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/uart_reg.h
    * |        |          |When one byte of TX FIFO is transferred to Transmitter Shift Register, TXPTR decreases one.
    * |        |          |The Maximum value shown in TXPTR is 32
    * |        |          |When the using level of TX FIFO Buffer equal to 32, the TXFULL bit is set to 1
    * |        |          |As one byte of TX FIFO is transferred to Transmitter Shift Register, the TXFULL bit is cleared to 0 and TXPTR will show 31.
    * |[22]    |TXEMPTY   |Transmitter FIFO Empty (Read Only)
    * |        |          |This bit indicates TX FIFO empty or not.
    * |        |          |0 = TX FIFO is not empty.
    * |        |          |1 = TX FIFO is empty.
    * |        |          |Note: When the last byte of TX FIFO has been transferred to Transmitter Shift Register, hardware sets this bit high
    * |        |          |It will be cleared when writing data into UART_DAT (TX FIFO not empty).
    * |[23]    |TXFULL    |Transmitter FIFO Full (Read Only)
    * |        |          |This bit indicates TX FIFO full or not.
    * |        |          |0 = TX FIFO is not full.
    * |        |          |1 = TX FIFO is full.
    * |        |          |Note: This bit is set when the number of usage in TX FIFO Buffer is equal to 32, otherwise it is cleared by hardware.
    * |[24]    |TXOVIF    |TX Overflow Error Interrupt Flag
    * |        |          |If TX FIFO (UART_DAT) is full, an additional write to UART_DAT will cause this bit to logic 1.
    * |        |          |0 = TX FIFO is not overflow.
    * |        |          |1 = TX FIFO is overflow.
    * |        |          |Note: This bit can be cleared by writing u201C1u201D to it.
    * |[28]    |TXEMPTYF  |Transmitter Empty Flag (Read Only)
    * |        |          |This bit is set by hardware when TX FIFO (UART_DAT) is empty and the STOP bit of the last byte has been transmitted.
    * |        |          |0 = TX FIFO is not empty or the STOP bit of the last byte has been not transmitted.
    * |        |          |1 = TX FIFO is empty and the STOP bit of the last byte has been transmitted.
    * |        |          |Note: This bit is cleared automatically when TX FIFO is not empty or the last byte transmission has not completed.
    * |[29]    |RXIDLE    |RX Idle Status (Read Only)
    * |        |          |This bit is set by hardware when RX is idle.
    * |        |          |0 = RX is busy.
    * |        |          |1 = RX is idle. (Default)
    * |[31]    |TXRXACT   |TX and RX Active Status (Read Only)
    * |        |          |This bit indicates TX and RX are active or inactive.
    * |        |          |0 = TX and RX are inactive.
    * |        |          |1 = TX and RX are active. (Default)
    * |        |          |Note: When TXRXDIS (UART_FUNCSEL[3]) is set and both TX and RX are in idle state, this bit is cleared
    * |        |          |The UART controller can not transmit or receive data at this moment
    * |        |          |Otherwise this bit is set.
    * @var UART_T::INTSTS
    * Offset: 0x1C  UART Interrupt Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |RDAIF     |Receive Data Available Interrupt Flag
    * |        |          |When the number of bytes in the RX FIFO equals the RFITL then the RDAIF(UART_INTSTS[0]) will be set
    * |        |          |If RDAIEN (UART_INTEN[0]) is enabled, the RDA interrupt will be generated.
    * |        |          |0 = No RDA interrupt flag is generated.
    * |        |          |1 = RDA interrupt flag is generated.
    * |        |          |Note: This bit is read only and it will be cleared when the number of unread bytes of RX FIFO drops below the threshold level (RFITL(UART_FIFO[7:4]).
    * |[1]     |THREIF    |Transmit Holding Register Empty Interrupt Flag
    * |        |          |This bit is set when the last data of TX FIFO is transferred to Transmitter Shift Register
    * |        |          |If THREIEN (UART_INTEN[1]) is enabled, the THRE interrupt will be generated.
    * |        |          |0 = No THRE interrupt flag is generated.
    * |        |          |1 = THRE interrupt flag is generated.
    * |        |          |Note: This bit is read only and it will be cleared when writing data into UART_DAT (TX FIFO not empty).
    * |[2]     |RLSIF     |Receive Line Interrupt Flag (Read Only)
    * |        |          |This bit is set when the RX receive data have parity error, frame error or break error (at least one of 3 bits, BIF(UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]) and PEF(UART_FIFOSTS[4]), is set)
    * |        |          |If RLSIEN (UART_INTEN[2]) is enabled, the RLS interrupt will be generated.
    * |        |          |0 = No RLS interrupt flag is generated.
    * |        |          |1 = RLS interrupt flag is generated.
    * |        |          |Note 1: In RS-485 function mode, this field is set include u201Creceiver detect and received address byte character (bit9 = u20181u2019) bit"
    * |        |          |At the same time, the bit of ADDRDETF (UART_FIFOSTS[3]) is also set.
    * |        |          |Note 2: This bit is read only and reset to 0 when all bits of BIF (UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]) and PEF(UART_FIFOSTS[4]) are cleared.
    * |        |          |Note 3: In RS-485 function mode, this bit is read only and reset to 0 when all bits of BIF (UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]), PEF(UART_FIFOSTS[4]) and ADDRDETF (UART_FIFOSTS[3]) are cleared.
    * |        |          |Note 4: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[3]     |MODEMIF   |MODEM Interrupt Flag (Read Only)
    * |        |          |This bit is set when the nCTS pin has state change (CTSDETF (UART_MODEMSTS[0]) = 1)
    * |        |          |If MODEMIEN (UART_INTEN[3]) is enabled, the Modem interrupt will be generated.
    * |        |          |0 = No Modem interrupt flag is generated.
    * |        |          |1 = Modem interrupt flag is generated.
    * |        |          |Note 1: This bit is read only and reset to 0 when bit CTSDETF is cleared by a write 1 on CTSDETF(UART_MODEMSTS[0]).
    * |        |          |Note 2: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[4]     |RXTOIF    |RX Time-out Interrupt Flag (Read Only)
    * |        |          |This bit is set when the RX FIFO is not empty and no activities occurred in the RX FIFO and the time-out counter equal to TOIC (UART_TOUT[7:0])
    * |        |          |If RXTOIEN (UART_INTEN[4]) is enabled, the RX time-out interrupt will be generated.
    * |        |          |0 = No RX time-out interrupt flag is generated.
    * |        |          |1 = RX time-out interrupt flag is generated.
    * |        |          |Note 1: This bit can be cleared by writing u201C1u201D to it.
    * |        |          |Note 2: If BITOMEN (UART_TOUT[31]) is reset to 0, user can read UART_DAT (RX is in active) to clear this bit.
    * |        |          |Note 3: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[5]     |BUFERRIF  |Buffer Error Interrupt Flag (Read Only)
    * |        |          |This bit is set when the TX FIFO or RX FIFO overflows (TXOVIF (UART_FIFOSTS[24]) or RXOVIF (UART_FIFOSTS[0]) is set)
    * |        |          |When BUFERRIF (UART_INTSTS[5]) is set, the transfer is not correct
    * |        |          |If BUFERRIEN (UART_INTEN[5]) is enabled, the buffer error interrupt will be generated.
    * |        |          |0 = No buffer error interrupt flag is generated.
    * |        |          |1 = Buffer error interrupt flag is generated.
    * |        |          |Note 1: This bit is cleared if both of RXOVIF(UART_FIFOSTS[0]) and TXOVIF(UART_FIFOSTS[24]) are cleared to 0 by writing 1 to RXOVIF(UART_FIFOSTS[0]) and TXOVIF(UART_FIFOSTS[24]).
    * |        |          |Note 2: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[6]     |WKIF      |UART Wake-up Interrupt Flag (Read Only)
    * |        |          |This bit is set when TOUTWKF (UART_WKSTS[4]), RS485WKF (UART_WKSTS[3]), RFRTWKF (UART_WKSTS[2]), DATWKF (UART_WKSTS[1]) or CTSWKF(UART_WKSTS[0]) is set to 1.
    * |        |          |0 = No UART wake-up interrupt flag is generated.
    * |        |          |1 = UART wake-up interrupt flag is generated.
    * |        |          |Note: This bit is cleared if all of TOUTWKF, RS485WKF, RFRTWKF, DATWKF and CTSWKF are cleared to 0 by writing 1 to the corresponding interrupt flag.
    * |[8]     |RDAINT    |Receive Data Available Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RDAIEN (UART_INTEN[0]) and RDAIF (UART_INTSTS[0]) are both set to 1.
    * |        |          |0 = No RDA interrupt is generated.
    * |        |          |1 = RDA interrupt is generated.
    * |[9]     |THREINT   |Transmit Holding Register Empty Interrupt Indicator (Read Only)
    * |        |          |This bit is set if THREIEN (UART_INTEN[1]) and THREIF(UART_INTSTS[1]) are both set to 1.
    * |        |          |0 = No THRE interrupt is generated.
    * |        |          |1 = THRE interrupt is generated.
    * |[10]    |RLSINT    |Receive Line Status Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RLSIEN (UART_INTEN[2]) and RLSIF(UART_INTSTS[2]) are both set to 1.
    * |        |          |0 = No RLS interrupt is generated.
    * |        |          |1 = RLS interrupt is generated.
    * |        |          |Note: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[11]    |MODEMINT  |MODEM Status Interrupt Indicator (Read Only)
    * |        |          |This bit is set if MODEMIEN(UART_INTEN[3]) and MODEMIF(UART_INTSTS[3]) are both set to 1
    * |        |          |0 = No Modem interrupt is generated.
    * |        |          |1 = Modem interrupt is generated.
    * |        |          |Note: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[12]    |RXTOINT   |RX Time-out Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RXTOIEN (UART_INTEN[4]) and RXTOIF(UART_INTSTS[4]) are both set to 1.
    * |        |          |0 = No RX time-out interrupt is generated.
    * |        |          |1 = RX time-out interrupt is generated.
    * |        |          |Note: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[13]    |BUFERRINT |Buffer Error Interrupt Indicator (Read Only)
    * |        |          |This bit is set if BUFERRIEN(UART_INTEN[5]) and BUFERRIF(UART_ INTSTS[5]) are both set to 1.
    * |        |          |0 = No buffer error interrupt is generated.
    * |        |          |1 = Buffer error interrupt is generated.
    * |        |          |Note: This bit is valid only when RXPDMAEN (UART_INTEN[15]) and TXPDMAEN (UART_INTEN[14]) are both 0.
    * |[14]    |WKINT     |UART Wake-up Interrupt Indicator (Read Only)
    * |        |          |This bit is set if WKIEN (UART_INTEN[6]) and WKIF (UART_INTSTS[6]) are both set to 1.
    * |        |          |0 = No UART wake-up interrupt is generated.
    * |        |          |1 = UART wake-up interrupt is generated.
    * |[18]    |HWRLSIF   |PDMA Mode Receive Line Status Flag (Read Only)
    * |        |          |This bit is set when the RX receive data have parity error, frame error or break error (at least one of 3 bits, BIF (UART_FIFOSTS[6]), FEF (UART_FIFOSTS[5]) and PEF (UART_FIFOSTS[4]) is set)
    * |        |          |If RLSIEN (UART_INTEN[2]) is enabled, the RLS interrupt will be generated.
    * |        |          |0 = No RLS interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = RLS interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |Note 1: In RS-485 function mode, this field include u201Creceiver detect any address byte received address byte character (bit9 = u20181u2019) bit".
    * |        |          |Note 2: In UART function mode, this bit is read only and reset to 0 when all bits of BIF(UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]) and PEF(UART_FIFOSTS[4]) are cleared.
    * |        |          |Note 3: In RS-485 function mode, this bit is read only and reset to 0 when all bits of BIF(UART_FIFOSTS[6]), FEF(UART_FIFOSTS[5]), PEF(UART_FIFOSTS[4]) and ADDRDETF (UART_FIFOSTS[3]) are cleared
    * |[19]    |HWMODIF   |PDMA Mode MODEM Interrupt Flag (Read Only)
    * |        |          |This bit is set when the nCTS pin has state change (CTSDETF (UART_MODEMSTS[0] =1))
    * |        |          |If MODEMIEN (UART_INTEN[3]) is enabled, the Modem interrupt will be generated.
    * |        |          |0 = No Modem interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = Modem interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |Note: This bit is read only and reset to 0 when the bit CTSDETF (UART_MODEMSTS[0]) is cleared by writing 1 on CTSDETF (UART_MODEMSTS[0]).
    * |[20]    |HWTOIF    |PDMA Mode RX Time-out Interrupt Flag (Read Only)
    * |        |          |This bit is set when the RX FIFO is not empty and no activities occurred in the RX FIFO and the time-out counter equal to TOIC (UART_TOUT[7:0])
    * |        |          |If RXTOIEN (UART_INTEN[4]) is enabled, the RX time-out interrupt will be generated .
    * |        |          |0 = No RX time-out interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = RX time-out interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |Note: This bit is read only and user can read UART_DAT (RX is in active) to clear it.
    * |[21]    |HWBUFEIF  |PDMA Mode Buffer Error Interrupt Flag (Read Only)
    * |        |          |This bit is set when the TX or RX FIFO overflows (TXOVIF (UART_FIFOSTS[24]) or RXOVIF (UART_FIFOSTS[0]) is set)
    * |        |          |When BUFERRIF (UART_INTSTS[5]) is set, the transfer maybe is not correct
    * |        |          |If BUFERRIEN (UART_INTEN[5]) is enabled, the buffer error interrupt will be generated.
    * |        |          |0 = No buffer error interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = Buffer error interrupt flag is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |Note: This bit is cleared when both TXOVIF (UART_FIFOSTS[24]]) and RXOVIF (UART_FIFOSTS[0]) are cleared.
    * |[22]    |TXENDIF   |Transmitter Empty Interrupt Flag (Read Only)
    * |        |          |This bit is set when TX FIFO (UART_DAT) is empty and the STOP bit of the last byte has been transmitted (TXEMPTYF (UART_FIFOSTS[28]) is set)
    * |        |          |If TXENDIEN (UART_INTEN[22]) is enabled, the Transmitter Empty interrupt will be generated.
    * |        |          |0 = No transmitter empty interrupt flag is generated.
    * |        |          |1 = Transmitter empty interrupt flag is generated.
    * |        |          |Note: This bit is cleared automatically when TX FIFO is not empty or the last byte transmission has not completed.
    * |[26]    |HWRLSINT  |PDMA Mode Receive Line Status Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RLSIEN (UART_INTEN[2]) and HWRLSIF(UART_INTSTS[18]) are both set to 1.
    * |        |          |0 = No RLS interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = RLS interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |[27]    |HWMODINT  |PDMA Mode MODEM Status Interrupt Indicator (Read Only)
    * |        |          |This bit is set if MODEMIEN (UART_INTEN[3]) and HWMODIF(UART_INTSTS[19]) are both set to 1.
    * |        |          |0 = No Modem interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = Modem interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |[28]    |HWTOINT   |PDMA Mode RX Time-out Interrupt Indicator (Read Only)
    * |        |          |This bit is set if RXTOIEN (UART_INTEN[4]) and HWTOIF(UART_INTSTS[20]) are both set to 1.
    * |        |          |0 = No RX time-out interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = RX time-out interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |[29]    |HWBUFEINT |PDMA Mode Buffer Error Interrupt Indicator (Read Only)
    * |        |          |This bit is set if BUFERRIEN (UART_INTEN[5]) and HWBUFEIF (UART_INTSTS[21]) are both set to 1.
    * |        |          |0 = No buffer error interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |        |          |1 = Buffer error interrupt is generated when RXPDMAEN (UART_INTEN[15]) or TXPDMAEN (UART_INTEN[14]) is 1.
    * |[30]    |TXENDINT  |Transmitter Empty Interrupt Indicator (Read Only)
    * |        |          |This bit is set if TXENDIEN (UART_INTEN[22]) and TXENDIF(UART_INTSTS[22]) are both set to 1.
    * |        |          |0 = No Transmitter Empty interrupt is generated.
    * |        |          |1 = Transmitter Empty interrupt is generated.
    * |[31]    |ABRINT    |Auto-baud Rate Interrupt Indicator (Read Only)
    * |        |          |This bit is set if ABRIEN (UART_INTEN[18]) and ABRIF (UART_ALTCTL[17]) are both set to 1.
    * |        |          |0 = No Auto-baud Rate interrupt is generated.
    * |        |          |1 = The Auto-baud Rate interrupt is generated.
    * @var UART_T::TOUT
    * Offset: 0x20  UART Time-out Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[7:0]   |TOIC      |Time-out Interrupt Comparator
    * |        |          |The time-out counter resets and starts counting (the counting clock = baud rate) whenever the RX FIFO receives a new data word if time out counter is enabled by setting TOCNTEN (UART_INTEN[11])
    * |        |          |Once the content of time-out counter is equal to that of time-out interrupt comparator (TOIC (UART_TOUT[7:0])), a receiver time-out interrupt (RXTOINT(UART_INTSTS[12])) is generated if RXTOIEN (UART_INTEN[4]) enabled
    * |        |          |A new incoming data word or RX FIFO empty will clear RXTOIF (UART_INTSTS[4])
    * |        |          |In order to avoid receiver time-out interrupt generation immediately during one character is being received, TOIC value should be set between 40 and 255
    * |        |          |So, for example, if TOIC is set with 40, the time-out interrupt is generated after four characters are not received when 1 stop bit and no parity check is set for UART transfer.
    * |[15:8]  |DLY       |TX Delay Time Value
    * |        |          |This field is used to programming the transfer delay time between the last stop bit and next start bit
    * |        |          |The unit is bit time.
    * |[27]    |TOFLUSHE  |RX PDMA Time-out Flush Enable Bit
    * |        |          |This bit can enable or disable RX PDMA time-out flush service.
    * |        |          |When TOFLUSHE (UART_TOUT[27]) is enabled, the UART will issue a flush request to the PDMA upon a time-out event
    * |        |          |The PDMA then flushes all data present in the UART RX FIFO at the time of the time-out into the PDMA, and subsequently flushes the data from the PDMA FIFO into system memory.
    * |        |          |0 = RX PDMA time-out flush Disabled.
    * |        |          |1 = RX PDMA time-out flush Enabled.
    * |        |          |Note: This bit has effect only when BITOMEN (UART_TOUT[31]) and TOCNTEN (UART_INTEN[11]) are both set.
    * |[31]    |BITOMEN   |Bus Idle Time-out Mode Enable Bit
    * |        |          |If BITOMEN (UART_TOUT[31]) is enabled, the reset conditions of the time-out counter and RXTOIF (UART_INTSTS[4]) will be changed to detect the bus idle.
    * |        |          |When BITOMEN (UART_TOUT[31]) is disabled, the time-out counter and RXTOIF (UART_INTSTS[4]) maintain reset value whenever the RX FIFO is empty
    * |        |          |In addition, Any RX FIFO activities, such as a new incoming data or user reading data, will clear RXTOIF (UART_INTSTS[4]) and reset RX time-out counter..
    * |        |          |On the other hand, when BITOMEN (UART_TOUT[31]) is enabled, the RX FIFO empty state will not reset the time-out counter and RXTOIF (UART_INTSTS[4]), and RX FIFO activities, such as a new incoming data or user reading data, will not clear RXTOIF (UART_INTSTS[4])
    * |        |          |However, the time-out counter needs to receive a first incoming data before it can start counting
    * |        |          |After receiving the first incoming data, the time-out counter will count even if the RX FIFO is empty.
    * |        |          |0 = Bus idle time-out mode Disabled.
    * |        |          |1 = Bus idle time-out mode Enabled.
    * @var UART_T::BAUD
    * Offset: 0x24  UART Baud Rate Divider Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[15:0]  |BRD       |Baud Rate Divider
    * |        |          |The field indicates the baud rate divider
    * |        |          |This filed is used in baud rate calculation
    * |        |          |The detail description is shown in Table 1.1-4.
    * |[23:16] |BRFD      |Baud Rate Fractional Divider
    * |        |          |This field is the fractional part of the baud rate divisor.
    * |        |          |When BRFDEN (UART_BAUD[30]) is set, the Baud Rate Equation goes to UART_CLK / ((BRD+2) + (BRFD/256)).
    * |        |          |For instance, if BRD = 0x8 and BRFD = 0x40, the baud rate would be UART_CLK / 10.25
    * |        |          |In practical, this represent 1 bit = 10 clocks, and for every 4 bits, the bit length becomes 11 clocks.
    * |        |          |As another example, if BRD = 0x8 and BRFD = 0x20, the baud rate would be UART_CLK / 10.125, which means 1 bit = 10 clocks, and for every 8 bits, the bit length becomes 11 clocks.
    * |[27:24] |EDIVM1    |Extra Divider for BAUD Rate Mode 1
    * |        |          |This field is used for baud rate calculation in mode 1 and has no effect for baud rate calculation in mode 0 and mode 2
    * |        |          |The detail description is shown in Table 1.1-4
    * |[28]    |BAUDM0    |BAUD Rate Mode Selection Bit 0
    * |        |          |This bit is baud rate mode selection bit 0
    * |        |          |UART provides three baud rate calculation modes
    * |        |          |This bit combines with BAUDM1 (UART_BAUD[29]) to select baud rate calculation mode
    * |        |          |The detail description is shown in Table 1.1-4.
    * |[29]    |BAUDM1    |BAUD Rate Mode Selection Bit 1
    * |        |          |This bit is baud rate mode selection bit 1
    * |        |          |UART provides three baud rate calculation modes
    * |        |          |This bit combines with BAUDM0 (UART_BAUD[28]) to select baud rate calculation mode
