yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/uart_reg.h
    * |        |          |The detail description is shown in Table 1.1-4.
    * |        |          |Note: In IrDA mode must be operated in mode 0.
    * |[30]    |BRFDEN    |Baud Rate Fractional Divider Enable Bit
    * |        |          |0 = Baud Rate Fractional Divider Disabled.
    * |        |          |1 = Baud Rate Fractional Divider Enabled.
    * |        |          |Note: This bit has effect only at baud rate mode 2 (BAUDM1 (UART_BAUD[29]) and BAUDM0 (UART_BAUD[28]) must be 1).
    * @var UART_T::IRDA
    * Offset: 0x28  UART IrDA Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[1]     |TXEN      |IrDA Receiver/Transmitter Selection Enable Bit
    * |        |          |0 = IrDA Transmitter Disabled and Receiver Enabled. (Default)
    * |        |          |1 = IrDA Transmitter Enabled and Receiver Disabled.
    * |[5]     |TXINV     |IrDA Inverse Transmitting Output Signal
    * |        |          |0 = None inverse transmitting signal. (Default).
    * |        |          |1 = Inverse transmitting output signal.
    * |        |          |Note 1: Before setting this bit, TXRXDIS (UART_FUNCSEL[3]) should be set then waited for TXRXACT (UART_FIFOSTS[31]) is cleared
    * |        |          |When the configuration is done, cleared TXRXDIS (UART_FUNCSEL[3]) to activate UART controller.
    * |        |          |Note 2: This bit is valid when FUNCSEL (UART_FUNCSEL[1:0]) is select IrDA function.
    * |[6]     |RXINV     |IrDA Inverse Receive Input Signal
    * |        |          |0 = None inverse receiving input signal.
    * |        |          |1 = Inverse receiving input signal. (Default)
    * |        |          |Note 1: Before setting this bit, TXRXDIS (UART_FUNCSEL[3]) should be set then waited for TXRXACT (UART_FIFOSTS[31]) is cleared
    * |        |          |When the configuration is done, cleared TXRXDIS (UART_FUNCSEL[3]) to activate UART controller.
    * |        |          |Note 2: This bit is valid when FUNCSEL (UART_FUNCSEL[1:0]) is select IrDA function.
    * @var UART_T::ALTCTL
    * Offset: 0x2C  UART Alternate Control/Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[8]     |RS485NMM  |RS-485 Normal Multi-drop Operation Mode
    * |        |          |0 = RS-485 Normal Multi-drop Operation mode (NMM) Disabled.
    * |        |          |1 = RS-485 Normal Multi-drop Operation mode (NMM) Enabled.
    * |        |          |Note: It cannot be active with RS-485_AAD operation mode.
    * |[9]     |RS485AAD  |RS-485 Auto Address Detection Operation Mode
    * |        |          |0 = RS-485 Auto Address Detection Operation mode (AAD) Disabled.
    * |        |          |1 = RS-485 Auto Address Detection Operation mode (AAD) Enabled.
    * |        |          |Note: It cannot be active with RS-485_NMM operation mode.
    * |[10]    |RS485AUD  |RS-485 Auto Direction Function
    * |        |          |0 = RS-485 Auto Direction Operation function (AUD) Disabled.
    * |        |          |1 = RS-485 Auto Direction Operation function (AUD) Enabled.
    * |        |          |Note: It can be active with RS-485_AAD or RS-485_NMM operation mode.
    * |[15]    |ADDRDEN   |RS-485 Address Detection Enable Bit
    * |        |          |This bit is used to enable RS-485 Address Detection mode.
    * |        |          |0 = Address detection mode Disabled.
    * |        |          |1 = Address detection mode Enabled.
    * |        |          |Note: This bit is used for RS-485 any operation mode.
    * |[17]    |ABRIF     |Auto-baud Rate Interrupt Flag (Read Only)
    * |        |          |This bit is set when auto-baud rate detection function finished or the auto-baud rate counter was overflow and if ABRIEN(UART_INTEN[18]) is set then the auto-baud rate interrupt will be generated.
    * |        |          |0 = No auto-baud rate interrupt flag is generated.
    * |        |          |1 = Auto-baud rate interrupt flag is generated.
    * |        |          |Note: This bit is read only, but it can be cleared by writing u201C1u201D to ABRDTOIF (UART_FIFOSTS[2]) and ABRDIF(UART_FIFOSTS[1])
    * |[18]    |ABRDEN    |Auto-baud Rate Detect Enable Bit
    * |        |          |0 = Auto-baud rate detect function Disabled.
    * |        |          |1 = Auto-baud rate detect function Enabled.
    * |        |          |Note: This bit is cleared automatically after auto-baud detection is finished.
    * |[20:19] |ABRDBITS  |Auto-baud Rate Detect Bit Length
    * |        |          |00 = 1-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x01.
    * |        |          |01 = 2-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x02.
    * |        |          |10 = 4-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x08.
    * |        |          |11 = 8-bit time from Start bit to the 1st rising edge. The input pattern shall be 0x80.
    * |        |          |Note: The calculation of bit number includes the START bit.
    * |[31:24] |ADDRMV    |Address Match Value
    * |        |          |This field contains the RS-485 address match values.
    * |        |          |Note: This field is used for RS-485 auto address detection mode.
    * @var UART_T::FUNCSEL
    * Offset: 0x30  UART Function Select Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[2:0]   |FUNCSEL   |Function Select
    * |        |          |000 = UART function.
    * |        |          |010 = IrDA function.
    * |        |          |011 = RS-485 function.
    * |        |          |100 = UART Single-wire function.
    * |        |          |Others = Reserved.
    * |[3]     |TXRXDIS   |TX and RX Disable Bit
    * |        |          |Setting this bit can disable TX and RX.
    * |        |          |0 = TX and RX Enabled.
    * |        |          |1 = TX and RX Disabled.
    * |        |          |Note: The TX and RX will not disable immediately when this bit is set
    * |        |          |The TX and RX compelet current task before disable TX and RX
    * |        |          |When TX and RX disable, the TXRXACT (UART_FIFOSTS[31]) is cleared.
    * @var UART_T::BRCOMP
    * Offset: 0x3C  UART Baud Rate Compensation Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[8:0]   |BRCOMP    |Baud Rate Compensation Patten
    * |        |          |These 9-bits are used to define the relative bit is compensated or not.
    * |        |          |BRCOMP[7:0] is used to define the compensation of UART_DAT[7:0] and BRCOM[8] is used to define the parity bit.
    * |[31]    |BRCOMPDEC |Baud Rate Compensation Decrease
    * |        |          |0 = Positive (increase one module clock) compensation for each compensated bit.
    * |        |          |1 = Negative (decrease one module clock) compensation for each compensated bit.
    * @var UART_T::WKCTL
    * Offset: 0x40  UART Wake-up Control Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |WKCTSEN   |nCTS Wake-up Enable Bit
    * |        |          |0 = nCTS Wake-up system function Disabled.
    * |        |          |1 = nCTS Wake-up system function Enabled.
    * |        |          |Note:When the system is in Power-down mode, an external.nCTS change will wake up system from Power-down mode.
    * |[1]     |WKDATEN   |Incoming Data Wake-up Enable Bit
    * |        |          |0 = Incoming data wake-up system function Disabled.
    * |        |          |1 = Incoming data wake-up system function Enabled.
    * |        |          |Note:When the system is in Power-down mode, incoming data will wake-up system from Power-down mode.
    * |[2]     |WKRFRTEN  |Received Data FIFO Reached Threshold Wake-up Enable Bit
    * |        |          |0 = Received Data FIFO reached threshold wake-up system function Disabled.
    * |        |          |1 = Received Data FIFO reached threshold wake-up system function Enabled.
    * |        |          |Note: When the system is in Power-down mode, Received Data FIFO reached threshold will wake-up system from Power-down mode.
    * |[3]     |WKRS485EN |RS-485 Address Match Wake-up Enable Bit
    * |        |          |0 = RS-485 Address Match (AAD mode) wake-up system function Disabled.
    * |        |          |1 = RS-485 Address Match (AAD mode) wake-up system function Enabled.
    * |        |          |Note 1: When the system is in.Power-down mode, RS-485 Address Match will wake-up system from Power-down mode.
    * |        |          |Note 2: This bit is used for RS-485 Auto Address Detection (AAD) mode in RS-485 function mode and ADDRDEN (UART_ALTCTL[15]) is set to 1.
    * |[4]     |WKTOUTEN  |Received Data FIFO Reached Threshold Time-out Wake-up Enable Bit
    * |        |          |0 = Received Data FIFO reached threshold time-out wake-up system function Disabled.
    * |        |          |1 = Received Data FIFO reached threshold time-out wake-up system function Enabled.
    * |        |          |Note 1: When the system is in Power-down mode, Received Data FIFO reached threshold time-out will wake up system from Power-down mode.
    * |        |          |Note 2: It is suggested the function is enabled when the WKRFRTEN (UART_WKCTL[2]) is set to 1.
    * @var UART_T::WKSTS
    * Offset: 0x44  UART Wake-up Status Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[0]     |CTSWKF    |nCTS Wake-up Flag
    * |        |          |This bit is set if chip wake-up from power-down state by nCTS wake-up.
    * |        |          |0 = Chip stays in power-down state.
    * |        |          |1 = Chip wake-up from power-down state by nCTS wake-up.
    * |        |          |Note 1: If WKCTSEN (UART_WKCTL[0]) is enabled, the nCTS wake-up cause this bit is set to u20181u2019.
    * |        |          |Note 2: This bit can be cleared by writing u20181u2019 to it.
    * |[1]     |DATWKF    |Incoming Data Wake-up Flag
    * |        |          |This bit is set if chip wake-up from power-down state by data wake-up.
    * |        |          |0 = Chip stays in power-down state.
    * |        |          |1 = Chip wake-up from power-down state by Incoming Data wake-up.
    * |        |          |Note 1: If WKDATEN (UART_WKCTL[1]) is enabled, the Incoming Data wake-up cause this bit is set to u20181u2019.
    * |        |          |Note 2: This bit can be cleared by writing u20181u2019 to it.
    * |[2]     |RFRTWKF   |Received Data FIFO Reached Threshold Wake-up Flag
    * |        |          |This bit is set if chip wake-up from power-down state by Received Data FIFO reached threshold
    * |        |          |wake-up .
    * |        |          |0 = Chip stays in power-down state.
    * |        |          |1 = Chip wake-up from power-down state by Received Data FIFO Reached Threshold wake-up.
    * |        |          |Note 1: If WKRFRTEN (UART_WKCTL[2]) is enabled, the Received Data FIFO Reached Threshold wake-up cause this bit is set to u20181u2019.
    * |        |          |Note 2: This bit can be cleared by writing u20181u2019 to it.
    * |[3]     |RS485WKF  |RS-485 Address Match Wake-up Flag
    * |        |          |This bit is set if chip wake-up from power-down state by RS-485 Address Match (AAD mode).
    * |        |          |0 = Chip stays in power-down state.
    * |        |          |1 = Chip wake-up from power-down state by RS-485 Address Match (AAD mode) wake-up.
    * |        |          |Note 1: If WKRS485EN (UART_WKCTL[3]) is enabled, the RS-485 Address Match (AAD mode) wake-up cause this bit is set to u20181u2019.
    * |        |          |Note 2: This bit can be cleared by writing u20181u2019 to it.
    * |[4]     |TOUTWKF   |Received Data FIFO Threshold Time-out Wake-up Flag
    * |        |          |This bit is set if chip wake-up from power-down state by Received Data FIFO Threshold Time-out
    * |        |          |wake-up.
    * |        |          |0 = Chip stays in power-down state.
    * |        |          |1 = Chip wake-up from power-down state by Received Data FIFO reached threshold time-out.
    * |        |          |Note 1: If WKTOUTEN (UART_WKCTL[4]) is enabled, the Received Data FIFO reached threshold time-out wake-up cause this bit is set to u20181u2019.
    * |        |          |Note 2: This bit can be cleared by writing u20181u2019 to it.
    * @var UART_T::DWKCOMP
    * Offset: 0x48  UART Incoming Data Wake-up Compensation Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[15:0]  |STCOMP    |Start Bit Compensation Value
    * |        |          |These bits field indicate how many clock cycle selected by UART_CLK do the UART controller can get the 1st bit (start bit) when the device is wake-up from Power-down mode.
    * |        |          |Note: It is valid only when WKDATEN (UART_WKCTL[1]) is set.
    * @var UART_T::RS485DD
    * Offset: 0x4C  UART RS485 Transceiver Deactivate Delay Register
    * ---------------------------------------------------------------------------------------------------
    * |Bits    |Field     |Descriptions
    * | :----: | :----:   | :---- |
    * |[15:0]  |RTSDDLY   |RS485 Transceiver Deactivate Delay Value
    * |        |          |These bits field indicate how many clock cycles selected by UART_CLK do the UART controller delay the RS485 transceiver state trancing when the state trancing of RS485 transceiver is from TX to RX state
    * |        |          |These bits field have no effect when the state trancing of RS485 transceiver is from RX to TX state.
    * |        |          |Note: It is valid only when RS485AUD (UART_ALTCTL[10]) is set.
    */
    __IO uint32_t DAT;                   /*!< [0x0000] UART Receive/Transmit Buffer Register                            */
    __IO uint32_t INTEN;                 /*!< [0x0004] UART Interrupt Enable Register                                   */
    __IO uint32_t FIFO;                  /*!< [0x0008] UART FIFO Control Register                                       */
    __IO uint32_t LINE;                  /*!< [0x000c] UART Line Control Register                                       */
    __IO uint32_t MODEM;                 /*!< [0x0010] UART Modem Control Register                                      */
    __IO uint32_t MODEMSTS;              /*!< [0x0014] UART Modem Status Register                                       */
    __IO uint32_t FIFOSTS;               /*!< [0x0018] UART FIFO Status Register                                        */
    __IO uint32_t INTSTS;                /*!< [0x001c] UART Interrupt Status Register                                   */
    __IO uint32_t TOUT;                  /*!< [0x0020] UART Time-out Register                                           */
    __IO uint32_t BAUD;                  /*!< [0x0024] UART Baud Rate Divider Register                                  */
    __IO uint32_t IRDA;                  /*!< [0x0028] UART IrDA Control Register                                       */
    __IO uint32_t ALTCTL;                /*!< [0x002c] UART Alternate Control/Status Register                           */
    __IO uint32_t FUNCSEL;               /*!< [0x0030] UART Function Select Register                                    */
    __IO uint32_t BRCOMP;                /*!< [0x003c] UART Baud Rate Compensation Register                             */
    __IO uint32_t WKCTL;                 /*!< [0x0040] UART Wake-up Control Register                                    */
    __IO uint32_t WKSTS;                 /*!< [0x0044] UART Wake-up Status Register                                     */
    __IO uint32_t DWKCOMP;               /*!< [0x0048] UART Incoming Data Wake-up Compensation Register                 */
    __IO uint32_t RS485DD;               /*!< [0x004c] UART RS485 Transceiver Deactivate Delay Register                 */
    __I  uint32_t RESERVE0[999];

